Benchmarks/complain_complainaudit_enforce/media-streaming/parser_output/output_run_1/result1.log

Total: connections 351 requests 5938 replies 5938 test-duration 330.132 s
Number of connected connections is currently = 0

Connection rate: 1.1 conn/s (940.5 ms/conn, <=351 concurrent connections)
Connected connection rate: 1.1 conn/s (940.5 ms/conn, <=351 concurrent connected connections)
Connection time [ms]: min 30011.6 avg 129274.0 max 320562.1 median 99999.5 stddev 101110.3
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 16.917

Response time (no timeouts) [ms]: 0.0
Response time (only timeouts) [ms]: 0.0
Response time (all) [ms]: 129274.0
Request rate: 18.0 req/s (55.6 ms/req)
Request size [B]: 139.0

Overall reply rate: 18.0 replies/sec
Reply rate [replies/s]: min 6.6 avg 18.0 max 140.0 stddev 23.8 (66 samples)
Reply time [ms]: response 0.9 transfer 4.4
Reply size [B]: header 294.0 content 3069212.0 footer 0.0 (total 3069506.0)
Reply status: 1xx=0 2xx=5938 3xx=0 4xx=0 5xx=0

CPU time [s]: user 1.54 system 24.90 (user 0.5% system 7.5% total 8.0%)
Net I/O: 53918.9 KB/s (441.7*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 addrinuse 0 other 0
Unconnected timeouts 0 connected timeouts 0 total (0) client_timeouts 0


Session rate [sess/s]: min 0.00 avg 1.06 max 7.20 stddev 2.51 (351/351)
Session: avg 1.00 connections/session
Session lifetime [s]: 129.3
Session failtime [s]: 0.0
Session length histogram: 0 0 0 0 0 0 0 72 0 0 68 0 0 0 0 72 0 70 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 69